<?php
namespace Jp\Skud\Sdl\IO;

/**
 * ロック方法のオプション値を表現するENUM
 */
enum LockModeModification : int
{
    // ================================================================
    // 列挙値
    // ================================================================
    /** 同時ロックの取得禁止 */
    case NotBlock = 4;






    // ================================================================
    // 関数
    // ================================================================
    /**
     * flock()関数向けのフラグ値を取得する。
     *
     * @return int
     */
    public function toOperator() : int
    {
        return $this->value;
    }
}
