<?php
namespace Jp\Skud\Sdl\IO;

/**
 * ロック方法を表現するENUM
 */
enum LockMode : int
{
    // ================================================================
    // 列挙値
    // ================================================================
    /** 共有ロック */
    case Shared = 1;

    /** 排他ロック */
    case Exclusive = 2;






    // ================================================================
    // 関数
    // ================================================================
    /**
     * flock()関数向けのフラグ値を取得する。
     *
     * @return int
     */
    public function toOperator() : int
    {
        return $this->value;
    }
}
